results/nemotron-3/nemotron-3-nano-4b/bf16/H_office-baseline.log
INFO 05-05 13:44:04 [nixl_utils.py:20] Setting UCX_RCACHE_MAX_UNRELEASED to '1024' to avoid a rare memory leak in UCX when using NIXL.
INFO 05-05 13:44:04 [nixl_utils.py:32] NIXL is available
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xeb4d8c6e0d60>, trust_remote_code=False, seed=42, num_prompts=200, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4000, random_output_len=500, random_range_ratio='0.9', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=None, model='nvidia/NVIDIA-Nemotron-3-Nano-4B-BF16', input_len=None, output_len=None, tokenizer='nvidia/NVIDIA-Nemotron-3-Nano-4B-BF16', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=0.3, burstiness=0.7, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/tmp', result_filename='H_office-baseline.json', ignore_eos=False, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,95,99', goodput=None, request_id_prefix='bench-42bc3f10-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name='nemotron-3-nano-4b-bf16', lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 05-05 13:44:06 [utils.py:90] Sampling input_len from [399, 7600] and output_len from [49, 950]
WARNING 05-05 13:44:08 [datasets.py:633] Across all generated prompts, there were 1 more tokens than expected after decoding and re-encoding. This is expected due to the imperfect nature of the sampling procedure.
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 0.3
Burstiness factor: 0.7 (Gamma distribution)
Maximum request concurrency: None
100%|██████████| 200/200 [11:30<00:00,  3.45s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200       
Failed requests:                         0         
Request rate configured (RPS):           0.30      
Benchmark duration (s):                  690.84    
Total input tokens:                      815936    
Total generated tokens:                  97092     
Request throughput (req/s):              0.29      
Output token throughput (tok/s):         140.54    
Peak output token throughput (tok/s):    330.00    
Peak concurrent requests:                15.00     
Total token throughput (tok/s):          1321.61   
---------------Time to First Token----------------
Mean TTFT (ms):                          743.41    
Median TTFT (ms):                        706.41    
P50 TTFT (ms):                           706.41    
P90 TTFT (ms):                           1227.34   
P95 TTFT (ms):                           1419.78   
P99 TTFT (ms):                           1966.00   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          44.73     
Median TPOT (ms):                        44.66     
P50 TPOT (ms):                           44.66     
P90 TPOT (ms):                           50.66     
P95 TPOT (ms):                           52.73     
P99 TPOT (ms):                           57.49     
---------------Inter-token Latency----------------
Mean ITL (ms):                           44.57     
Median ITL (ms):                         39.63     
P50 ITL (ms):                            39.63     
P90 ITL (ms):                            43.50     
P95 ITL (ms):                            45.67     
P99 ITL (ms):                            242.38    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          22381.55  
Median E2EL (ms):                        22023.10  
P50 E2EL (ms):                           22023.10  
P90 E2EL (ms):                           38719.57  
P95 E2EL (ms):                           41666.87  
P99 E2EL (ms):                           45056.02  
==================================================